app/views/users/show.html.erb

  <ul>
    <li><% @user.requests.each do |request| %>
---
SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = ?  [["user_id", 9]]