app/controllers/application_controller.rb

  def access_allowed
	   @request = Request.find(params[:id])
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]