app/controllers/days_controller.rb

  def index
    @days = Day.all
---
SELECT "days".* FROM "days"

  def create
    @day = current_user.days.build(day_params)
    if @day.save
---
INSERT INTO "days" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-07-23 23:36:28.147845"], ["updated_at", "2018-07-23 23:36:28.147845"]]

  def edit
    @day = Day.find(params[:id])
---
SELECT  "days".* FROM "days" WHERE "days"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]