app/controllers/requests_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "requests" ("day_id", "user_id", "reason", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["day_id", 1], ["user_id", 9], ["reason", "Dad's birthday"], ["created_at", "2018-07-29 20:57:50.686117"], ["updated_at", "2018-07-29 20:57:50.686117"]]
---
  def create
    @user = User.find_by(id: params[:id])
    @request = Request.new(request_params)

    if @request.save

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @request = Request.find_by(id: params[:id])

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "requests" SET "reason" = ?, "day_id" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["reason", ""], ["day_id", 5], ["updated_at", "2018-08-08 00:15:31.177915"], ["id", 2]]
---
  def update
    @request = Request.find(params[:id])
    if @request.update(request_params)

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 14]]
---
  def destroy
    @request = Request.find_by(id: params[:id])
    @request.destroy

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def access_allowed
      @request = Request.find(params[:id])