app/controllers/sessions_controller.rb

  def create
      if auth
        @user = User.find_or_create_by(username: auth["info"]["email"]) do |u|
          u.password = Password.pronounceable 9
        end

      if @user.save
        session[:user_id] = @user.id
        redirect_to user_path(current_user)
      end

    else #regular login below

      @user = User.find_or_create_by(username: params[:user][:username])
      if params[:user][:username].empty? || params[:user][:password].empty?
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "samantha.marie.garcia@gmail.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", ""], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", ""], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "SamanthaMGarcia"], ["LIMIT", 1]]