app/controllers/titles_controller.rb

  def index
    user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @user = User.find(params[:user_id])
    @title = Title.new(title_params)
    if @title.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "titles" ("title_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title_name", "Associate"], ["user_id", 2], ["created_at", "2018-08-09 22:50:37.091720"], ["updated_at", "2018-08-09 22:50:37.091720"]]