app/models/request.rb

  def day_attributes=(day_hash)
    ymd = "#{day_hash["dayoff(1i)"]}-#{day_hash["dayoff(2i)"]}-#{day_hash["dayoff(3i)"]}"
    self.day = Day.find_or_create_by(:dayoff => ymd)
    self.save
---
INSERT INTO "days" ("dayoff", "created_at", "updated_at") VALUES (?, ?, ?)  [["dayoff", "2018-08-25"], ["created_at", "2018-08-04 14:47:22.766580"], ["updated_at", "2018-08-04 14:47:22.766580"]]
SELECT  "days".* FROM "days" WHERE "days"."dayoff" = ? LIMIT ?  [["dayoff", "2018-08-25"], ["LIMIT", 1]]
INSERT INTO "requests" ("day_id", "user_id", "reason", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["day_id", 1], ["user_id", 9], ["reason", "Dad's birthday"], ["created_at", "2018-07-29 20:57:50.686117"], ["updated_at", "2018-07-29 20:57:50.686117"]]
UPDATE "requests" SET "reason" = ?, "day_id" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["reason", ""], ["day_id", 5], ["updated_at", "2018-08-08 00:15:31.177915"], ["id", 2]]